eet_cz/views/eet_message_view.xml

<?xml version="1.0" encoding="utf-8"?>
<odoo>
    <data>
        <template id="eet_message_template">
            <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:eet="http://fs.mfcr.cz/eet/schema/v3">
                <soap:Header>
                    <wsse:Security soap:mustUnderstand="1">
                        <wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" t-att="{'wsu:Id': soap_env_attribs['binarysecuritytoken_id']}"><t t-esc="certificate"/></wsse:BinarySecurityToken>
                        <ds:Signature t-att-Id="soap_env_attribs['signature_id']">
                            <ds:SignedInfo>
                                <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                                    <ec:InclusiveNamespaces PrefixList="soap"/>
                                </ds:CanonicalizationMethod>
                                <ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
                                <ds:Reference t-att-URI="soap_env_attribs['ds_reference_uri']">
                                    <ds:Transforms>
                                        <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                                            <ec:InclusiveNamespaces PrefixList=""/>
                                        </ds:Transform>
                                    </ds:Transforms>
                                    <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
                                    <ds:DigestValue></ds:DigestValue>
                                </ds:Reference>
                            </ds:SignedInfo>
                            <ds:SignatureValue></ds:SignatureValue>
                            <ds:KeyInfo t-att-Id="soap_env_attribs['keyinfo_id']">
                                <wsse:SecurityTokenReference t-att="{'wsu:Id': soap_env_attribs['securitytokenreference_id']}">
                                    <wsse:Reference t-att-URI="soap_env_attribs['wsse_reference_uri']" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/>
                                </wsse:SecurityTokenReference>
                            </ds:KeyInfo>
                        </ds:Signature>
                    </wsse:Security>
                </soap:Header>
                <soap:Body t-att="{'wsu:Id': soap_env_attribs['body_id']}">
                    <eet:Trzba>
                        <eet:Hlavicka   t-att-uuid_zpravy="header['uuid_zpravy']"
                                        t-att-dat_odesl="header['dat_odesl']"
                                        t-att-prvni_zaslani="header['prvni_zaslani']"
                                        t-att-overeni="header['overeni']"/>
                        <eet:Data   t-att-dic_popl="data['dic_popl']"
                                    t-att-id_provoz="data['id_provoz']"
                                    t-att-id_pokl="data['id_pokl']"
                                    t-att-porad_cis="data['porad_cis']"
                                    t-att-dat_trzby="data['dat_trzby']"
                                    t-att-celk_trzba="data['celk_trzba']"
                                    t-att-zakl_nepodl_dph="data['zakl_nepodl_dph']"
                                    t-att-zakl_dan1="data['zakl_dan1']"
                                    t-att-dan1="data['dan1']"
                                    t-att-zakl_dan2="data['zakl_dan2']"
                                    t-att-dan2="data['dan2']"
                                    t-att-zakl_dan3="data['zakl_dan3']"
                                    t-att-dan3="data['dan3']"
                                    t-att-cest_sluz="data['cest_sluz']"
                                    t-att-pouzit_zboz1="data['pouzit_zboz1']"
                                    t-att-pouzit_zboz2="data['pouzit_zboz2']"
                                    t-att-pouzit_zboz3="data['pouzit_zboz3']"
                                    t-att-urceno_cerp_zuct="data['urceno_cerp_zuct']"
                                    t-att-cerp_zuct="data['cerp_zuct']"
                                    t-att-rezim="data['rezim']"
                                    t-att="{'dic_poverujiciho': data['dic_poverujiciho']} if data.get('dic_poverujiciho', False) else {}"/>
                        <eet:KontrolniKody>
                            <eet:pkp digest="SHA256" cipher="RSA2048" encoding="base64"><t t-esc="pkp_code"/></eet:pkp>
                            <eet:bkp digest="SHA1" encoding="base16"><t t-esc="bkp_code"/></eet:bkp>
                        </eet:KontrolniKody>
                    </eet:Trzba>
                </soap:Body>
            </soap:Envelope>
        </template>
    </data>
</odoo>
